@Jasper-Ben  working for me with the PR applied, seems that fix it

```
terraform apply
An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # rancher2_namespace.jenkins will be created
  + resource "rancher2_namespace" "jenkins" {
      + annotations      = (known after apply)
      + id               = (known after apply)
      + labels           = (known after apply)
      + name             = "jenkins"
      + project_id       = "local:p-qrs4z"
      + wait_for_cluster = false
    }

  # rancher2_catalog.helmStable will be created
  + resource "rancher2_catalog" "helmStable" {
      + annotations = (known after apply)
      + branch      = "master"
      + id          = (known after apply)
      + kind        = "helm"
      + labels      = (known after apply)
      + name        = "helm-stable"
      + project_id  = "local:p-qrs4z"
      + refresh     = false
      + scope       = "project"
      + url         = "https://kubernetes-charts.storage.googleapis.com"
      + version     = "helm_v3"
    }

  # rancher2_app.jenkins will be created
  + resource "rancher2_app" "jenkins" {
      + annotations      = (known after apply)
      + catalog_name     = "p-qrs4z:helm-stable"
      + description      = (known after apply)
      + external_id      = (known after apply)
      + force_upgrade    = false
      + id               = (known after apply)
      + labels           = (known after apply)
      + name             = "jenkins"
      + project_id       = "local:p-qrs4z"
      + revision_id      = (known after apply)
      + target_namespace = "jenkins"
      + template_name    = "jenkins"
      + template_version = "1.19.0"
    }

Plan: 3 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

rancher2_catalog.helmStable: Creating...
rancher2_namespace.jenkins: Creating...
rancher2_catalog.helmStable: Creation complete after 1s [id=p-qrs4z:helm-stable]
rancher2_namespace.jenkins: Creation complete after 1s [id=jenkins]
rancher2_app.jenkins: Creating...
rancher2_app.jenkins: Creation complete after 5s [id=p-qrs4z:jenkins]

Apply complete! Resources: 3 added, 0 changed, 0 destroyed.
```